In [1]:
import pandas as pd
import numpy as np

In [2]:
dictData = {'Istanbul' : [30,29,np.nan] ,'Ankara' : [20,np.nan,25],'Izmir' : [40,39,38]}

In [3]:
weatherDataFrame = pd.DataFrame(dictData, index = [1,2,3])

In [4]:
weatherDataFrame

   Istanbul  Ankara  Izmir
1      30.0    20.0     40
2      29.0     NaN     39
3       NaN    25.0     38

In [5]:
weatherDataFrame.dropna() # return row and new dataframe

   Istanbul  Ankara  Izmir
1      30.0    20.0     40

In [6]:
weatherDataFrame.dropna(axis=1) # return nonempty colunms due to the axis1 and new dataframe

   Izmir
1     40
2     39
3     38

In [7]:
newdictData = {'Istanbul' : [30,29,np.nan] ,'Ankara' : [20,np.nan,25],'Izmir' : [40,39,38] ,'Antalya' : [45,np.nan,np.nan]}

In [8]:
newWeatherDataFrame = pd.DataFrame(newdictData, index =[1,2,3])

In [9]:
newWeatherDataFrame

   Istanbul  Ankara  Izmir  Antalya
1      30.0    20.0     40     45.0
2      29.0     NaN     39      NaN
3       NaN    25.0     38      NaN

In [10]:
newWeatherDataFrame.dropna()

   Istanbul  Ankara  Izmir  Antalya
1      30.0    20.0     40     45.0

In [11]:
newWeatherDataFrame.dropna(axis=1 ,thresh=2) # thresh means drop na 2=>

   Istanbul  Ankara  Izmir
1      30.0    20.0     40
2      29.0     NaN     39
3       NaN    25.0     38

In [12]:
newWeatherDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
1      30.0    20.0     40     45.0
2      29.0    20.0     39     20.0
3      20.0    25.0     38     20.0

In [13]:
newWeatherDataFrame

   Istanbul  Ankara  Izmir  Antalya
1      30.0    20.0     40     45.0
2      29.0     NaN     39      NaN
3       NaN    25.0     38      NaN

## Group by

In [14]:
incomeData = {'Department': ['Finance','Finance','Software','Law','Marketing'] ,
            'Name' : ['Ahmet' ,'Ali', 'Mehmet' ,'Atil' ,'Burak'] , 
            'Income' : [100, 125, 250, 200, 300]
              }

In [15]:
incomeDataFrame = pd.DataFrame(incomeData)

In [16]:
incomeDataFrame

  Department    Name  Income
0    Finance   Ahmet     100
1    Finance     Ali     125
2   Software  Mehmet     250
3        Law    Atil     200
4  Marketing   Burak     300

In [17]:
groupObj = incomeDataFrame.groupby('Department')

In [18]:
groupObj.count()

            Name  Income
Department
Finance        2       2
Law            1       1
Marketing      1       1
Software       1       1

In [22]:

groupObj['Income'].mean()

Department
Finance      112.5
Law          200.0
Marketing    300.0
Software     250.0
Name: Income, dtype: float64

In [23]:
groupObj.min()

              Name  Income
Department
Finance      Ahmet     100
Law           Atil     200
Marketing    Burak     300
Software    Mehmet     250

In [26]:
groupObj.min()

              Name  Income
Department
Finance      Ahmet     100
Law           Atil     200
Marketing    Burak     300
Software    Mehmet     250

In [27]:
groupObj.describe()

           Income
            count   mean       std    min     25%    50%     75%    max
Department
Finance       2.0  112.5  17.67767  100.0  106.25  112.5  118.75  125.0
Law           1.0  200.0       NaN  200.0  200.00  200.0  200.00  200.0
Marketing     1.0  300.0       NaN  300.0  300.00  300.0  300.00  300.0
Software      1.0  250.0       NaN  250.0  250.00  250.0  250.00  250.0

In [ ]:
()